/*using System;
class PleaseSayUra
{
    static void Main()
    {
        Console.WriteLine("Ура!");
        Console.ReadLine();
    }
}
*/
//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
/*void Comparison(int a, int b)
{
    if(a > b)
    {
        Console.WriteLine($"Max number {a}");
    }
    else
    {
        Console.WriteLine($"Max number {b}");
    }
}
Console.Write("Input a first number: ");
int n1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input a second number: ");
int n2 = Convert.ToInt32(Console.ReadLine());
Comparison(n1, n2);
*/
//Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
/*int Comparison(int a, int b, int c)
{
    int max = a;
    if(b > max) max = b;
    if(c > max) max = c;
    return max;
}
Console.Write("Input a first number: ");
int n1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input a second number: ");
int n2 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input a third number: ");
int n3 = Convert.ToInt32(Console.ReadLine());
int res = Comparison(n1, n2, n3);
Console.WriteLine($"Your max number {res}");
*/
//Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
/*bool Examination(int num)
{
    if(num % 2 == 0)
    {
        return true;
    }
    else
    {
        return false;
    }
}
Console.Write("Input your number: ");
int Num = Convert.ToInt32(Console.ReadLine());
bool res = Examination(Num);
Console.WriteLine(res);
*/
/*using System;
class WriteAFewLines
{
    static void Main()
    {
        Console.WriteLine("Введите ваше любимое слово: ");
        string favoriteWord = Console.ReadLine();
        Console.WriteLine("Сколько раз его напечатать? ");
        int numberOfTimes = Convert.ToInt32(Console.ReadLine());
        for ( int i = 0; i < numberOfTimes; i++)
        {
            Console.WriteLine(favoriteWord);
        }
        Console.ReadLine();
    }
}
*/
